# GetRenderingImageExposureSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..GetRenderingImageExposureSettings Method
RenderingSettings Class See Also
---
Returns an object that represents the rendering image exposure settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RenderingImageExposureSettings GetRenderingImageExposureSettings()
```

Visual Basic
---
```text
Public Function GetRenderingImageExposureSettings As RenderingImageExposureSettings
```

Visual C++
---
```text
public:
RenderingImageExposureSettings^ GetRenderingImageExposureSettings()
```

# ### Return Value
The rendering image exposure settings.
# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace